In [1]:
%reset -f

In [2]:
import os
import pandas as pd

# Go up one level and into 'data'
data_path = os.path.join('..', 'data')
print(os.listdir(data_path))

['economies.csv', 'countries.csv', 'cities.csv', 'populations.csv', 'languages.csv', 'currencies.csv']

## Countries

Primary keys need to be defined on columns that don't accept duplicate or null values. Also, primary key constraints are time-invariant!

So i think ***code*** which is country_code can be primary key in here.

In [3]:
df_countries = pd.read_csv("../data/countries.csv")

In [5]:
df_countries.head(3)

,code,country_name,continent,region,surface_area,indep_year,local_name,gov_form,capital,cap_long,cap_lat
0,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,Afganistan/Afqanestan,Islamic Emirate,Kabul,69.17610,34.5228
1,NLD,Netherlands,Europe,Western Europe,41526.0,1581.0,Nederland,Constitutional Monarchy,Amsterdam,4.89095,52.3738
2,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,Shqiperia,Republic,Tirane,19.81720,41.3317

In [6]:
df_countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   code          205 non-null    object
 1   country_name  205 non-null    object
 2   continent     205 non-null    object
 3   region        205 non-null    object
 4   surface_area  205 non-null    float64
 5   indep_year    188 non-null    float64
 6   local_name    205 non-null    object
 7   gov_form      205 non-null    object
 8   capital       201 non-null    object
 9   cap_long      203 non-null    float64
 10  cap_lat       203 non-null    float64
dtypes: float64(4), object(7)
memory usage: 17.7+ KB

In [16]:
df_countries['code'].duplicated().sum()

0

## Economy

For primary keys, duplicates and "NULL" values are allowed!
So here I think ***(code, year)*** is the Primary key and 'code' is the foreign key!

In [23]:
df_economies = pd.read_csv("../data/economies.csv")

In [24]:
df_economies.head()

,econ_id,code,year,income_group,gdp_percapita,gross_savings,inflation_rate,total_investment,unemployment_rate,exports,imports
0,1,AFG,2010,Low income,539.667,37.133,2.179,30.402,NaN,46.394,24.381
1,2,AFG,2015,Low income,615.091,21.466,-1.549,18.602,NaN,-49.110,-7.294
2,3,AGO,2010,Upper middle income,3599.270,23.534,14.480,14.433,NaN,-3.266,-21.076
3,4,AGO,2015,Upper middle income,3876.200,-0.425,10.287,9.552,NaN,6.721,-21.778
4,5,ALB,2010,Upper middle income,4098.130,20.011,3.605,31.305,14.0,10.645,-8.013

In [25]:
df_economies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 380 entries, 0 to 379
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   econ_id            380 non-null    int64
 1   code               380 non-null    object
 2   year               380 non-null    int64
 3   income_group       380 non-null    object
 4   gdp_percapita      378 non-null    float64
 5   gross_savings      338 non-null    float64
 6   inflation_rate     377 non-null    float64
 7   total_investment   344 non-null    float64
 8   unemployment_rate  217 non-null    float64
 9   exports            351 non-null    float64
 10  imports            349 non-null    float64
dtypes: float64(7), int64(2), object(2)
memory usage: 32.8+ KB

In [26]:
df_economies['code'].duplicated().sum()

190

## CITIES

In [27]:
df_cities = pd.read_csv("../data/cities.csv")

df_cities.head()

          name country_code  city_proper_pop  metroarea_pop  urbanarea_pop
0      Abidjan          CIV          4765000            NaN        4765000
1    Abu Dhabi          ARE          1145000            NaN        1145000
2        Abuja          NGA          1235880      6000000.0        1235880
3        Accra          GHA          2070463      4010054.0        2070463
4  Addis Ababa          ETH          3103673      4567857.0        3103673

In [28]:
df_cities.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 236 entries, 0 to 235
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   name             236 non-null    object
 1   country_code     236 non-null    object
 2   city_proper_pop  236 non-null    int64
 3   metroarea_pop    137 non-null    float64
 4   urbanarea_pop    236 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 9.3+ KB

In [33]:
df_cities[['name', 'country_code']].duplicated().sum()

0

In [34]:
df_cities['name'].duplicated().sum()

0

## Population

PRIMARY KEY (country_code, year)

In [35]:
df_population = pd.read_csv('../data/populations.csv')

In [36]:
df_population.head()

   pop_id country_code  year  fertility_rate  life_expectancy        size
0      20          ABW  2010           1.704        74.953537    101597.0
1      19          ABW  2015           1.647        75.573585    103889.0
2       2          AFG  2010           5.746        58.970829  27962207.0
3       1          AFG  2015           4.653        60.717171  32526562.0
4      12          AGO  2010           6.416        50.654171  21219954.0

In [73]:
df_population.info()

<class 'pandas.core.frame.DataFrame'>
Index: 434 entries, 20 to 432
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   country_code     434 non-null    object
 1   year             434 non-null    int64
 2   fertility_rate   402 non-null    float64
 3   life_expectancy  398 non-null    float64
 4   size             433 non-null    float64
dtypes: float64(3), int64(1), object(1)
memory usage: 20.3+ KB

## Language

PRIMARY (code, name)

In [37]:
df_lang = pd.read_csv("../data/languages.csv")

In [38]:
df_lang.head()

   lang_id code      name  percent  official
0        1  AFG      Dari     50.0      True
1        2  AFG    Pashto     35.0      True
2        3  AFG    Turkic     11.0     False
3        4  AFG     Other      4.0     False
4        5  ALB  Albanian     98.8      True

In [39]:
df_lang.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 955 entries, 0 to 954
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   lang_id   955 non-null    int64
 1   code      955 non-null    object
 2   name      955 non-null    object
 3   percent   518 non-null    float64
 4   official  955 non-null    bool
dtypes: bool(1), float64(1), int64(1), object(2)
memory usage: 30.9+ KB

## Currency

PRIMARY KEY (code, curr_code)

In [40]:
df_cur = pd.read_csv("../data/currencies.csv")

In [41]:
df_cur.head()

   curr_id code      basic_unit curr_code frac_unit  frac_perbasic
0        1  AFG  Afghan afghani       AFN       Pul          100.0
1        2  ALB    Albanian lek       ALL  Qindarke          100.0
2        3  DZA  Algerian dinar       DZD   Santeem          100.0
3        4  AND            Euro       EUR      Cent          100.0
4        5  AGO  Angolan kwanza       AOA   Centimo          100.0

In [42]:
df_cur.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 224 entries, 0 to 223
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   curr_id        224 non-null    int64
 1   code           224 non-null    object
 2   basic_unit     224 non-null    object
 3   curr_code      224 non-null    object
 4   frac_unit      223 non-null    object
 5   frac_perbasic  223 non-null    float64
dtypes: float64(1), int64(1), object(4)
memory usage: 10.6+ KB

In [45]:
df_cur['code'][df_cur['code'].duplicated()]

17     BLR
23     BTN
30     BRN
35     KHM
54     CUB
111    LSO
135    NAM
150    PSE
152    PAN
174    SGP
201    TUV
204    UKR
217    ZWE
218    ZWE
219    ZWE
220    ZWE
221    ZWE
222    ZWE
223    ZWE
Name: code, dtype: object

In [46]:
df_cur[df_cur['code'] == 'ZWE']

     curr_id code            basic_unit curr_code frac_unit  frac_perbasic
216      217  ZWE         Botswana pula       BWP     Thebe          100.0
217      218  ZWE         British pound       GBP     Penny          100.0
218      219  ZWE          Chinese yuan       CNY       Fen          100.0
219      220  ZWE                  Euro       EUR      Cent          100.0
220      221  ZWE          Indian rupee       INR     Paisa          100.0
221      222  ZWE          Japanese yen       JPY       Sen          100.0
222      223  ZWE    South African rand       ZAR      Cent          100.0
223      224  ZWE  United States dollar       USD      Cent          100.0

In [57]:
['economies.csv', 'cities.csv', 'populations.csv', 'languages.csv', 'currencies.csv']

['economies.csv',
 'cities.csv',
 'populations.csv',
 'languages.csv',
 'currencies.csv']

In [58]:
df_economies.columns

Index(['code', 'year', 'income_group', 'gdp_percapita', 'gross_savings',
       'inflation_rate', 'total_investment', 'unemployment_rate', 'exports',
       'imports'],
      dtype='object')

In [59]:
df_cities.columns

Index(['country_code', 'city_proper_pop', 'metroarea_pop', 'urbanarea_pop'], dtype='object')

In [60]:
df_population.columns

Index(['country_code', 'year', 'fertility_rate', 'life_expectancy', 'size'], dtype='object')

In [61]:
df_lang.columns

Index(['code', 'name', 'percent', 'official'], dtype='object')

In [63]:
df_cur.columns

Index(['code', 'basic_unit', 'curr_code', 'frac_unit', 'frac_perbasic'], dtype='object')

In [84]:
df_countries.head()

,code,country_name,continent,region,surface_area,indep_year,local_name,gov_form,capital,cap_long,cap_lat
0,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,Afganistan/Afqanestan,Islamic Emirate,Kabul,69.17610,34.5228
1,NLD,Netherlands,Europe,Western Europe,41526.0,1581.0,Nederland,Constitutional Monarchy,Amsterdam,4.89095,52.3738
2,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,Shqiperia,Republic,Tirane,19.81720,41.3317
3,DZA,Algeria,Africa,Northern Africa,2381740.0,1962.0,Al-Jazair/Algerie,Republic,Algiers,3.05097,36.7397
4,ASM,American Samoa,Oceania,Polynesia,199.0,NaN,Amerika Samoa,US Territory,Pago Pago,-170.69100,-14.2846